# IsStraight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..IsStraight Property
FabricationServiceButton Class See Also
---
Checks if all of the fabrication service button conditions are straights.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsStraight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsStraight As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsStraight {
	bool get ();
}
```

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace